app/Controllers/AmazonTransactions.php

            $payment_currency = $row['U'];
            $program_type = $row['V'];

            $amazon_book = $db->table('amazon_books')->where('asin', $asin)->get()->getRowArray();
---
SELECT *
FROM `amazon_books`
WHERE `asin` = 'B07XTQ6VYX'

            $book_id = $amazon_book['book_id'];
            $copyright_owner = $amazon_book['copyright_owner'];

            $book_details = $db->table('book_tbl')->where('book_id', $book_id)->get()->getRowArray();
---
SELECT *
FROM `book_tbl`
WHERE `book_id` = '4550'

                log_message('warning', "Non-numeric royalty value for book_id {$book_id}: " . json_encode($royalty_raw));
            }

            $author_details = $db->table('author_tbl')->where('author_id', $author_id)->get()->getRowArray();
---
SELECT *
FROM `author_tbl`
WHERE `author_id` = '7'

                'status' => 'O'
            ];

            $db->table('amazon_transactions')->insert($insert_data);
---
INSERT INTO `amazon_transactions` (`invoice_date`, `original_invoice_date`, `asin`, `physical_isbn10`, `physical_isbn13`, `digital_isbn`, `title`, `author`, `units_purchased`, `units_refunded`, `net_units`, `net_units_mtd`, `adjustments_made`, `list_price`, `list_price_currency`, `publisher_price`, `publisher_price_currency`, `discount_percentage`, `payment_amount`, `payment_currency`, `program_type`, `book_id`, `author_id`, `user_id`, `copyright_owner`, `language_id`, `currency_exchange`, `inr_value`, `tax_value`, `final_royalty_value`, `status`) VALUES ('2025-06-30', '2025-07-01', 'B07XTQ6VYX', '', '', '', 'Ragasiyam Parama(n) Ragasiyam (Tamil Edition)', 'Indira Soundarajan', 1, 0, 1, 1, 0, 7.03, 'EUR', 7.5, 'USD', 60, 2.81, 'EUR', 'FR', '4550', '7', '32', '32', '1', 85, 203.02, 35.83, 101.51, 'O')