app/Models/AdminModel.php

public function getAdminUsers()
{
    $query = $this->db->table('users_tbl')
                      ->groupStart()
                          ->where('user_type', 3)
                          ->orWhere('user_type', 4)
                      ->groupEnd()
                      ->get();
---
SELECT * FROM `users_tbl` WHERE (users_tbl.user_type = 3 or users_tbl.user_type = 4 or users_tbl.user_type = 5 or users_tbl.user_type = 7) and users_tbl.email = 'sinekarajendran03@gmail.com' and users_tbl.password = '4732210395731ca375874a1e7c8f62f6'