app/Models/PodModel.php

    public function getPublisherById($id)
    {
        return $this->db->table('pod_publisher')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `pod_publisher`
WHERE `id` = '7'

public function getPaidInvoiceBooks($publisher_id)
        {
            return $this->db->table('pod_publisher_books')
                ->select('book_id, book_title, num_copies, invoice_value, invoice_number, invoice_date, payment_date')
                ->where('publisher_id', $publisher_id)
                ->where('invoice_flag', 1)
                ->where('payment_flag', 1)
                ->get()
                ->getResultArray();
---
SELECT `book_id`, `book_title`, `num_copies`, `invoice_value`, `invoice_number`, `invoice_date`
FROM `pod_publisher_books`
WHERE `publisher_id` = '7'
AND `invoice_flag` = 1
AND `payment_flag` = 0