app/Models/StockModel.php

                'updated_user_id'=>session()->get('user_id'),
                'validated_flag'=>0,
            ];
            $this->db->table('paperback_stock')->insert($insert_data);
---
INSERT INTO `paperback_stock` (`book_id`, `quantity`, `stock_in_hand`, `last_update_date`) VALUES ('4', '5', '5', '2025-07-23 05:32:37')

            'pay_status' => 'O',
            'comments' => $comments
        ];
        $this->db->table('author_transaction')->insert($transaction_data);
---
INSERT INTO `author_transaction` (`book_id`, `order_id`, `order_date`, `author_id`, `order_type`, `copyright_owner`, `currency`, `book_final_royalty_value_inr`, `pay_status`, `comments`) VALUES ('4', 1753248757, '2025-07-23 05:32:37', '9', 15, '9', 'INR', 0, 'O', 'Paperback royalty @ 20%, Per book cost: ; Qty: 5')

            'stock_in' => $qty,
            'transaction_date' => date('Y-m-d H:i:s')
        ];
        $this->db->table('pustaka_paperback_stock_ledger')->insert($stock_data);
---
INSERT INTO `pustaka_paperback_stock_ledger` (`book_id`, `order_id`, `author_id`, `copyright_owner`, `description`, `channel_type`, `stock_in`, `transaction_date`) VALUES ('4', 1753248757, '9', '9', 'Stock added to Inventory', 'STK', '5', '2025-07-23 05:32:37')

    public function getBookDetails($book_id)
    {
        $data = $this->db->table('paperback_stock')
            ->select('book_tbl.book_title, paperback_stock.book_id, paperback_stock.last_update_date, paperback_stock.quantity, paperback_stock.stock_in_hand')
            ->join('book_tbl', 'paperback_stock.book_id = book_tbl.book_id')
            ->where('paperback_stock.book_id', $book_id)
            ->get()
            ->getRowArray();
---
SELECT `book_tbl`.`book_title`, `paperback_stock`.`book_id`, `paperback_stock`.`last_update_date`, `paperback_stock`.`quantity`, `paperback_stock`.`stock_in_hand`
FROM `paperback_stock`
JOIN `book_tbl` ON `paperback_stock`.`book_id` = `book_tbl`.`book_id`
WHERE `paperback_stock`.`book_id` = '2'

    public function getAuthorTransaction($book_id)
    {
        return $this->db->table('author_transaction')
            ->select('
                author_transaction.id,
                author_transaction.book_id,
                book_tbl.book_title,
                author_transaction.order_date,
                author_transaction.comments,
                paperback_stock.quantity,
                paperback_stock.stock_in_hand
            ')
            ->join('book_tbl', 'book_tbl.book_id = author_transaction.book_id')
            ->join('paperback_stock', 'paperback_stock.book_id = author_transaction.book_id')
            ->where('author_transaction.book_id', $book_id)
            ->where('DATE(author_transaction.order_date) = CURDATE()')
            ->orderBy('author_transaction.id', 'DESC')
            ->get()
            ->getRowArray();
---
SELECT `author_transaction`.`id`, `author_transaction`.`book_id`, `book_tbl`.`book_title`, `author_transaction`.`order_date`, `author_transaction`.`comments`, `paperback_stock`.`quantity`, `paperback_stock`.`stock_in_hand`
FROM `author_transaction`
JOIN `book_tbl` ON `book_tbl`.`book_id` = `author_transaction`.`book_id`
JOIN `paperback_stock` ON `paperback_stock`.`book_id` = `author_transaction`.`book_id`
WHERE `author_transaction`.`book_id` = '2'
AND DATE(author_transaction.order_date) = CURDATE()
ORDER BY `author_transaction`.`id` DESC

    public function getStockLedger($book_id)
    {
        return $this->db->table('pustaka_paperback_stock_ledger')
            ->select('
                pustaka_paperback_stock_ledger.id,
                pustaka_paperback_stock_ledger.transaction_date,
                pustaka_paperback_stock_ledger.book_id,
                pustaka_paperback_stock_ledger.description,
                pustaka_paperback_stock_ledger.stock_in,
                pustaka_paperback_stock_ledger.current_stock AS quantity,
                pustaka_paperback_stock_ledger.channel_type,
                book_tbl.book_title
            ')
            ->join('book_tbl', 'book_tbl.book_id = pustaka_paperback_stock_ledger.book_id')
            ->where('pustaka_paperback_stock_ledger.book_id', $book_id)
            ->orderBy('pustaka_paperback_stock_ledger.id', 'DESC')
            ->get()
            ->getRowArray();
---
SELECT `pustaka_paperback_stock_ledger`.`id`, `pustaka_paperback_stock_ledger`.`transaction_date`, `pustaka_paperback_stock_ledger`.`book_id`, `pustaka_paperback_stock_ledger`.`description`, `pustaka_paperback_stock_ledger`.`stock_in`, `pustaka_paperback_stock_ledger`.`current_stock` AS `quantity`, `pustaka_paperback_stock_ledger`.`channel_type`, `book_tbl`.`book_title`
FROM `pustaka_paperback_stock_ledger`
JOIN `book_tbl` ON `book_tbl`.`book_id` = `pustaka_paperback_stock_ledger`.`book_id`
WHERE `pustaka_paperback_stock_ledger`.`book_id` = '2'
ORDER BY `pustaka_paperback_stock_ledger`.`id` DESC