app/Models/TpPublisherModel.php

SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_details`
WHERE `status` = 1
AND `status` = 0
---
    public function countData($publisher_id = null): array
{
    $data = [];

    // Publishers count
    $publisherQuery = $this->db->table('tp_publisher_details');
    if ($publisher_id && $publisher_id !== 'all') {
        $publisherQuery->where('publisher_id', $publisher_id); // Use publisher_id instead of id
    }
    $data['active_publisher_cnt'] = $publisherQuery->where('status', 1)->countAllResults(false);