app/Models/TpPublisherModel.php

    public function countData(): array
    {
        $data = [];

        // Publishers (Using model's default table)
        $data['active_publisher_cnt'] = $this->where('status', 1)->countAllResults(false);
        $data['inactive_publisher_cnt'] = $this->where('status', 0)->countAllResults(false);

        // Authors
        $authorTbl = $this->db->table('tp_publisher_author_details');
        $data['active_author_cnt'] = $authorTbl->where('status', 1)->countAllResults(false);

        $authorTbl = $this->db->table('tp_publisher_author_details');
        $data['inactive_author_cnt'] = $authorTbl->where('status', 0)->countAllResults(false);

        // Books
        $bookTbl = $this->db->table('tp_publisher_bookdetails');
        $data['active_book_cnt'] = $bookTbl->where('status', 1)->countAllResults(false);

        $bookTbl = $this->db->table('tp_publisher_bookdetails');
        $data['inactive_book_cnt'] = $bookTbl->where('status', 0)->countAllResults(false);

        $bookTbl = $this->db->table('tp_publisher_bookdetails');
        $data['pending_book_cnt'] = $bookTbl->where('status', 2)->countAllResults(false);

       $result = $this->db->table('tp_publisher_book_stock')
        ->selectSum('book_quantity')
        ->get()
        ->getRow();

        $data['tot_stock_count'] = $result->book_quantity ?? 0;

        $result = $this->db->table('tp_publisher_book_stock')
            ->selectSum('stock_in_hand')
            ->get()
            ->getRow();

        $data['stock_in_hand'] = $result->stock_in_hand ?? 0;
         $result = $this->db->table('tp_publisher_book_stock_ledger')
            ->selectSum('stock_out')
            ->get()
            ->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_author_details`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_author_details`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_bookdetails`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_bookdetails`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `tp_publisher_bookdetails`
WHERE `status` = 2
SELECT SUM(`book_quantity`) AS `book_quantity`
FROM `tp_publisher_book_stock`
SELECT SUM(`stock_in_hand`) AS `stock_in_hand`
FROM `tp_publisher_book_stock`
SELECT SUM(`stock_out`) AS `stock_out`
FROM `tp_publisher_book_stock_ledger`

public function tpPublisherOrderPayment($publisher_id = null)
{
    $builder = $this->db->table('tp_publisher_order o');
    $builder->select('
        o.order_id,
        o.order_date,
        o.ship_date,
        o.payment_status,
        o.sub_total,
        o.courier_charges,
        o.royalty,
        p.publisher_name,
        MAX(od.ship_status) AS ship_status
    ');
    $builder->join('tp_publisher_order_details od', 'od.order_id = o.order_id', 'left');
    $builder->join('tp_publisher_details p', 'p.publisher_id = o.publisher_id', 'left');

    $builder->groupBy('
        o.order_id,
        o.order_date,
        o.ship_date,
        o.payment_status,
        o.sub_total,
        o.courier_charges,
        o.royalty,
        p.publisher_name
    ');

$builder->orderBy('o.order_id', 'DESC');

$result = $builder->get()->getResultArray();
---
SELECT *
FROM `tp_publisher_details`
ORDER BY `publisher_id` ASC